Repository: antohal2/maclm_agent
Catalog: maclm-agent/Localizable.xcstrings
Source language: en
Languages: ru

# Сессий нет
source: No sessions
ru: Сессий нет

# Сессия %lld
source: Session %lld
ru: Сессия %lld

# Открыть в чате
source: Open in chat
ru: Открыть в чате

# Быстрый запрос
source: Quick request
ru: Быстрый запрос

# Скрывать содержимое
source: Hide content
ru: Скрывать содержимое

# Не дублировать уведомления о завершении, пока питомец на экране
source: Suppress duplicate completion notifications while the pet is visible
ru: Не дублировать уведомления о завершении, пока питомец на экране

# Осторожно
source: Caution
ru: Осторожно

# Опасно
source: Dangerous
ru: Опасно

# Разрешить
source: Allow
ru: Разрешить

# Отклонить
source: Reject
ru: Отклонить

# (не указан)
source: (not specified)
ru: (не указан)

# 30 дней
source: 30 days
ru: 30 дней

# 90 дней
source: 90 days
ru: 90 дней

# Auto
source: System
ru: Auto

# Auto следует системной теме macOS.
source: System follows the macOS appearance.
ru: Auto следует системной теме macOS.

# LLM-провайдер не настроен. Выберите обнаруженную модель или задайте URL вручную.
source: No LLM provider configured. Select a discovered model or add a server URL.
ru: LLM-провайдер не настроен. Выберите обнаруженную модель или задайте URL вручную.

# LLM-сервер найден, но на нём нет доступных моделей.
source: LLM server found, but it has no available models.
ru: LLM-сервер найден, но на нём нет доступных моделей.

# run_shell выполняет произвольные команды; правила на него не распространяются.
source: run_shell runs arbitrary commands; rules do not apply to it.
ru: run_shell выполняет произвольные команды; правила на него не распространяются.

# {{input}} будет заменён текстом из буфера обмена.
source: {{input}} will be replaced with clipboard text.
ru: {{input}} будет заменён текстом из буфера обмена.

# Адрес
source: Address
ru: Адрес

# Аргументы
source: Arguments
ru: Аргументы

# Аргументы (сохранённый вид)
source: Arguments (stored representation)
ru: Аргументы (сохранённый вид)

# Аргументы (точный JSON)
source: Arguments (exact JSON)
ru: Аргументы (точный JSON)

# Ассистент
source: Assistant
ru: Ассистент

# Безопасность
source: Security
ru: Безопасность

# Беседа и все её сообщения будут удалены без возможности восстановления.
source: The conversation and all its messages will be permanently deleted.
ru: Беседа и все её сообщения будут удалены без возможности восстановления.

# Беседы
source: Conversations
ru: Беседы

# Бессрочно
source: Forever
ru: Бессрочно

# Блокировка ~/.ssh/** не остановит cat ~/.ssh/id_rsa.
source: Blocking ~/.ssh/** will not stop cat ~/.ssh/id_rsa.
ru: Блокировка ~/.ssh/** не остановит cat ~/.ssh/id_rsa.

source: The original patterns, actions, descriptions and order of all 16 built-in rules will be restored;
ru: Будут восстановлены исходные паттерны, действия, описания и порядок всех 16 встроенных правил;

# Буфер обмена
source: Clipboard
ru: Буфер обмена

# Буфер обмена пуст
source: Clipboard is empty
ru: Буфер обмена пуст

# Быстрый пикер
source: Quick picker
ru: Быстрый пикер

# Включено
source: Enabled
ru: Включено

# Внешний вид
source: Appearance
ru: Внешний вид

# Внимание: предельно широкий паттерн, включая всю файловую систему для ** и /**.
source: Warning: extremely broad pattern, including the entire file system for ** and /**.
ru: Внимание: предельно широкий паттерн, включая всю файловую систему для ** и /**.

# Внимательно читайте команду на карточке.
source: Read the command on the approval card carefully.
ru: Внимательно читайте команду на карточке.

# Восстановить
source: Recover
ru: Восстановить

# Восстановить встроенные правила?
source: Restore built-in rules?
ru: Восстановить встроенные правила?

# Время
source: Time
ru: Время

# Все
source: All
ru: Все

source: All 6 built-in actions will be restored: edited fields, order and enabled state
ru: Все 6 встроенных действий будут восстановлены: изменённые поля, порядок и включённость

# Все беседы
source: All conversations
ru: Все беседы

# Все записи будут удалены без возможности восстановления.
source: All entries will be permanently deleted.
ru: Все записи будут удалены без возможности восстановления.

# Вставить {{input}}
source: Insert {{input}}
ru: Вставить {{input}}

# Вставлять результат автоматически
source: Paste results automatically
ru: Вставлять результат автоматически

# Вставьте его вручную через ⌘V.
source: Paste it manually with ⌘V.
ru: Вставьте его вручную через ⌘V.

# Встроенное действие
source: Built-in action
ru: Встроенное действие

# Встроенное правило
source: Built-in rule
ru: Встроенное правило

# Вы
source: You
ru: Вы

# Выберите действие
source: Choose an action
ru: Выберите действие

# Выберите действие слева или создайте новое
source: Select an action on the left or create one
ru: Выберите действие слева или создайте новое

# Выполнить инструмент с уровнем риска, требующим подтверждения.
source: Run a tool whose risk level requires approval.
ru: Выполнить инструмент с уровнем риска, требующим подтверждения.

# Выполнить указанную ниже команду через /bin/zsh -c.
source: Run the command below through /bin/zsh -c.
ru: Выполнить указанную ниже команду через /bin/zsh -c.

# Глоб: * и ? внутри компонента; ** пересекает /.
source: Glob: * and ? match within a component; ** crosses /.
ru: Глоб: * и ? внутри компонента; ** пересекает /.

# Глобальный хоткей
source: Global shortcut
ru: Глобальный хоткей

# Год
source: One year
ru: Год

# Готово
source: Done
ru: Готово

# Действие
source: Action
ru: Действие

# Действие будет удалено.
source: The action will be deleted.
ru: Действие будет удалено.

# Действия не найдены
source: No actions found
ru: Действия не найдены

# Действия с буфером
source: Clipboard actions
ru: Действия с буфером

# Диапазон дат
source: Date range
ru: Диапазон дат

# Для авто-вставки нужен доступ к Универсальному доступу.
source: Automatic paste requires Accessibility access.
ru: Для авто-вставки нужен доступ к Универсальному доступу.

# Добавить
source: Add
ru: Добавить

# Добавить всё равно
source: Add anyway
ru: Добавить всё равно

# Добавить папку…
source: Add folder…
ru: Добавить папку…

# Добавить правило…
source: Add rule…
ru: Добавить правило…

# Добавить разрешённую директорию
source: Add an allowed directory
ru: Добавить разрешённую директорию

# Добавить эндпоинт?
source: Add endpoint?
ru: Добавить эндпоинт?

# Доступен
source: Available
ru: Доступен

# Его можно вернуть кнопкой «Сбросить встроенные действия».
source: You can restore it using Reset built-in actions.
ru: Его можно вернуть кнопкой «Сбросить встроенные действия».

# Единственная защита — подтверждение каждой команды на карточке.
source: The only protection is approval of every command on its card.
ru: Единственная защита — подтверждение каждой команды на карточке.

# Журнал аудита
source: Audit log
ru: Журнал аудита

# Журнал аудита…
source: Audit log…
ru: Журнал аудита…

# Журнал очищен.
source: Audit log cleared.
ru: Журнал очищен.

# Загрузить ещё 200
source: Load 200 more
ru: Загрузить ещё 200

# Закрыть
source: Close
ru: Закрыть

# Записать данные в файл с указанными ниже точными параметрами.
source: Write data to a file using the exact parameters below.
ru: Записать данные в файл с указанными ниже точными параметрами.

source: Writing and moving within these folders is caution: permission can be remembered for the session. Outside them, every dangerous call requires approval.
ru: Запись и перемещение внутри этих папок получают уровень caution: разрешение можно запомнить на сессию. Вне них — dangerous с подтверждением каждого вызова.

source: Only caution permissions are remembered. Dangerous calls always require approval. Permissions are cleared when the app restarts.
ru: Запоминаются только разрешения caution. Dangerous подтверждается каждый раз. При перезапуске приложения память очищается.

# Запретить · block
source: Deny · block
ru: Запретить · block

# Запросить доступ
source: Request access
ru: Запросить доступ

# Изменения текущего действия будут потеряны.
source: Changes to the current action will be lost.
ru: Изменения текущего действия будут потеряны.

# Измените поисковый запрос
source: Change the search query
ru: Измените поисковый запрос

# Изменить
source: Edit
ru: Изменить

# Измерение
source: Dimension
ru: Измерение

# Имя SF Symbol
source: SF Symbol name
ru: Имя SF Symbol

# Инструмент
source: Tool
ru: Инструмент

# Инструмент (точное имя)
source: Tool (exact name)
ru: Инструмент (точное имя)

# Инструмент имеет базовый уровень dangerous и требует отдельного подтверждения.
source: The tool has a base dangerous risk level and requires separate approval.
ru: Инструмент имеет базовый уровень dangerous и требует отдельного подтверждения.

source: Using a manually configured server. The connection will be checked when sending.
ru: Используется заданный вручную сервер. Проверка соединения выполнится при отправке.

# Исход
source: Outcome
ru: Исход

# Команды
source: Commands
ru: Команды

# Комбинация уже назначена другому хоткею приложения.
source: This shortcut is already assigned to another app action.
ru: Комбинация уже назначена другому хоткею приложения.

# Куда
source: Destination
ru: Куда

source: No local LLM servers found. Start LM Studio or Ollama, or add a server URL.
ru: Локальные LLM-серверы не найдены. Запустите LM Studio или Ollama либо задайте URL вручную.

# Локальный ассистент
source: Local assistant
ru: Локальный ассистент

# Модели
source: Models
ru: Модели

# Модель не выбрана
source: No model selected
ru: Модель не выбрана

# Нажмите поле и введите сочетание. По умолчанию — ⌘⇧Space.
source: Click the field and press a shortcut. Default: ⌘⇧Space.
ru: Нажмите поле и введите сочетание. По умолчанию — ⌘⇧Space.

# Нажмите поле, затем новое сочетание. Требуется Command, Control или Option.
source: Click the field, then press a new shortcut. Command, Control or Option is required.
ru: Нажмите поле, затем новое сочетание. Требуется Command, Control или Option.

# Нажмите сочетание…
source: Press shortcut…
ru: Нажмите сочетание…

# Название
source: Name
ru: Название

# Название действия
source: Action name
ru: Название действия

# Найди самые большие файлы в папке Загрузки
source: Find the largest files in Downloads
ru: Найди самые большие файлы в папке Загрузки

# Найти действие
source: Find action
ru: Найти действие

# Настройки
source: Settings
ru: Настройки

# Настройки провайдера
source: Provider settings
ru: Настройки провайдера

# Не сохранять
source: Discard
ru: Не сохранять

# Не спрашивать снова в этой сессии
source: Do not ask again in this session
ru: Не спрашивать снова в этой сессии

# Не удалось сохранить изменения
source: Could not save changes
ru: Не удалось сохранить изменения

# Недоступен
source: Unavailable
ru: Недоступен

# Неизвестная ошибка.
source: Unknown error.
ru: Неизвестная ошибка.

# Несохранённые изменения
source: Unsaved changes
ru: Несохранённые изменения

# Нет включённых действий
source: No enabled actions
ru: Нет включённых действий

# Нет действий
source: No actions
ru: Нет действий

# Нет запомненных разрешений.
source: No remembered permissions.
ru: Нет запомненных разрешений.

# Нет моделей
source: No models
ru: Нет моделей

# Нет решения: принуждение по этому измерению не включено.
source: No decision: enforcement for this dimension is not enabled.
ru: Нет решения: принуждение по этому измерению не включено.

# Нет решения: совпавших включённых правил нет.
source: No decision: no enabled rules match.
ru: Нет решения: совпавших включённых правил нет.

# Новая беседа
source: New conversation
ru: Новая беседа

# Новое действие
source: New action
ru: Новое действие

# Новое правило
source: New rule
ru: Новое правило

# Обновить
source: Refresh
ru: Обновить

# Объект будет перемещён в Корзину. Это изменение файловой системы.
source: The item will be moved to Trash. This changes the file system.
ru: Объект будет перемещён в Корзину. Это изменение файловой системы.

# Ожидание
source: Idle
ru: Ожидание

# Ожидание результата…
source: Waiting for result…
ru: Ожидание результата…

# Опасно · dangerous
source: Dangerous · dangerous
ru: Опасно · dangerous

# Описание
source: Description
ru: Описание

# Основные
source: General
ru: Основные

# Остановить
source: Stop
ru: Остановить

# Остановить генерацию
source: Stop generation
ru: Остановить генерацию

# Осторожно · caution
source: Caution · caution
ru: Осторожно · caution

# Отклонён
source: Rejected
ru: Отклонён

# Открыть главное окно
source: Open main window
ru: Открыть главное окно

# Открыть журнал…
source: Open audit log…
ru: Открыть журнал…

# Открыть настройки системы
source: Open System Settings
ru: Открыть настройки системы

# Откуда
source: Source
ru: Откуда

# Отмена
source: Cancel
ru: Отмена

# Отменить
source: Cancel
ru: Отменить

# Отправить
source: Send
ru: Отправить

# Оформление
source: Appearance
ru: Оформление

# Очистить
source: Clear
ru: Очистить

# Очистить весь журнал аудита?
source: Clear the entire audit log?
ru: Очистить весь журнал аудита?

# Очистить журнал
source: Clear audit log
ru: Очистить журнал

# Ошибка
source: Error
ru: Ошибка

# Ошибка сохранения
source: Save error
ru: Ошибка сохранения

# Параметры действия
source: Action settings
ru: Параметры действия

# Паттерн
source: Pattern
ru: Паттерн

# Паттерн не совпадает
source: Pattern does not match
ru: Паттерн не совпадает

# Паттерн совпадает
source: Pattern matches
ru: Паттерн совпадает

# Переименовать беседу
source: Rename conversation
ru: Переименовать беседу

# Переименовать…
source: Rename…
ru: Переименовать…

# Переместить файл или каталог в Корзину.
source: Move a file or directory to Trash.
ru: Переместить файл или каталог в Корзину.

# Переместить файл или каталог.
source: Move a file or directory.
ru: Переместить файл или каталог.

# Перемещение в Корзину требует отдельного подтверждения.
source: Moving to Trash requires separate approval.
ru: Перемещение в Корзину требует отдельного подтверждения.

# Переписка и содержимое файлов будут отправляться на этот хост
source: Conversations and file contents will be sent to this host
ru: Переписка и содержимое файлов будут отправляться на этот хост

# Печатает…
source: Typing…
ru: Печатает…

# По
source: To
ru: По

# По завершении команды все оставшиеся фоновые процессы останавливаются.
source: All remaining background processes are stopped when the command finishes.
ru: По завершении команды все оставшиеся фоновые процессы останавливаются.

# Подтвердите отправку данных на этот хост.
source: Confirm sending data to this host.
ru: Подтвердите отправку данных на этот хост.

# Подтвердить
source: Confirm
ru: Подтвердить

# Поиск действий
source: Search actions
ru: Поиск действий

# Поиск: инструмент или аргументы
source: Search: tool or arguments
ru: Поиск: инструмент или аргументы

source: No folders configured: every write and move requires approval (dangerous)
ru: Пока не задано: любая запись и перемещение файлов требуют подтверждения каждый раз (уровень dangerous)

# Показать или скрыть панель
source: Show or hide panel
ru: Показать или скрыть панель

# Показать скрытые модели
source: Show hidden models
ru: Показать скрытые модели

# Полная команда
source: Full command
ru: Полная команда

# Пользовательские действия и их порядок не изменятся.
source: Custom actions and their order will remain unchanged.
ru: Пользовательские действия и их порядок не изменятся.

# Пользовательские правила, их состояния и порядок не изменятся.
source: Custom rules, their states and order will remain unchanged.
ru: Пользовательские правила, их состояния и порядок не изменятся.

# Правила безопасности
source: Security rules
ru: Правила безопасности

# Правила по путям действуют только на файловые инструменты.
source: Path rules apply only to file tools.
ru: Правила по путям действуют только на файловые инструменты.

# Приложения
source: Applications
ru: Приложения

# Применится после перезапуска
source: Takes effect after restart
ru: Применится после перезапуска

# Применить действие к тексту в буфере
source: Apply action to clipboard text
ru: Применить действие к тексту в буфере

# Применяются к шести файловым инструментам. Block всегда приоритетнее allow.
source: Applies to the six file tools. Block always takes precedence over allow.
ru: Применяются к шести файловым инструментам. Block всегда приоритетнее allow.

# Провайдер не выбран
source: No provider selected
ru: Провайдер не выбран

# Провайдер недоступен — запустите LM Studio или Ollama.
source: Provider unavailable — start LM Studio or Ollama.
ru: Провайдер недоступен — запустите LM Studio или Ollama.

# Проверить
source: Check
ru: Проверить

# Проверить на примере
source: Test an example
ru: Проверить на примере

# Проверка учитывает несохранённый вариант и весь набор правил;
source: The test uses the unsaved draft and the entire rule set;
ru: Проверка учитывает несохранённый вариант и весь набор правил;

# Проверка…
source: Checking…
ru: Проверка…

# Прочитай файл и кратко перескажи его содержание
source: Read a file and briefly summarize its contents
ru: Прочитай файл и кратко перескажи его содержание

# Пути
source: Paths
ru: Пути

# Путь
source: Path
ru: Путь

# Разрешения текущей сессии
source: Current session permissions
ru: Разрешения текущей сессии

# Разрешено. Выполняется…
source: Approved. Running…
ru: Разрешено. Выполняется…

# Разрешить · allow
source: Allow · allow
ru: Разрешить · allow

# Разрешён
source: Approved
ru: Разрешён

# Разрешённые директории · allowed_dirs
source: Allowed directories · allowed_dirs
ru: Разрешённые директории · allowed_dirs

# Редактирование правила
source: Edit rule
ru: Редактирование правила

# Редактор действий
source: Action editor
ru: Редактор действий

# Режим
source: Mode
ru: Режим

# Результат
source: Result
ru: Результат

# Решение
source: Decision
ru: Решение

# Риск
source: Risk
ru: Риск

# С
source: From
ru: С

# Сбросить
source: Reset
ru: Сбросить

# Сбросить встроенные действия
source: Reset built-in actions
ru: Сбросить встроенные действия

# Сбросить встроенные действия?
source: Reset built-in actions?
ru: Сбросить встроенные действия?

# Сбросить встроенные правила…
source: Reset built-in rules…
ru: Сбросить встроенные правила…

# Свой эндпоинт…
source: Custom endpoint…
ru: Свой эндпоинт…

# Сетевые хосты
source: Network hosts
ru: Сетевые хосты

# Система
source: System
ru: Система

# Системный
source: System
ru: Системный

# Скопируйте текст и снова вызовите быстрый пикер
source: Copy text and open the quick picker again
ru: Скопируйте текст и снова вызовите быстрый пикер

# Скрыть статус
source: Hide status
ru: Скрыть статус

# Совпадение с каталогом распространяется на потомков.
source: A directory match applies to its descendants.
ru: Совпадение с каталогом распространяется на потомков.

# Создайте действие кнопкой +
source: Create an action using +
ru: Создайте действие кнопкой +

# Создать действие
source: Create action
ru: Создать действие

# Сообщение для локальной модели
source: Message for the local model
ru: Сообщение для локальной модели

# Сохранить
source: Save
ru: Сохранить

# Сохраняются, но пока не применяются. Принуждение — v0.6 (Shell).
source: Stored but not yet enforced. Enforcement: v0.6 (Shell).
ru: Сохраняются, но пока не применяются. Принуждение — v0.6 (Shell).

# Сохраняются, но пока не применяются. Принуждение — v0.7 (AppleScript).
source: Stored but not yet enforced. Enforcement: v0.7 (AppleScript).
ru: Сохраняются, но пока не применяются. Принуждение — v0.7 (AppleScript).

source: Stored but not yet enforced. Checks are limited to explicit URLs in arguments:
ru: Сохраняются, но пока не применяются. Проверка ограничивается явными URL в аргументах:

source: The saved server is not responding. Your selection is preserved; check the server or add another URL.
ru: Сохранённый сервер сейчас не отвечает. Выбор сохранён; проверьте сервер или задайте другой URL.

# Сохранённый сервер сейчас не отвечает. Можно выбрать один из обнаруженных.
source: The saved server is not responding. You can select a discovered server.
ru: Сохранённый сервер сейчас не отвечает. Можно выбрать один из обнаруженных.

# Срок хранения
source: Retention
ru: Срок хранения

# Таймаут, секунд
source: Timeout, seconds
ru: Таймаут, секунд

# Тема
source: Theme
ru: Тема

# Тип
source: Type
ru: Тип

# Точное содержимое
source: Exact contents
ru: Точное содержимое

# У встроенного правила меняется только включение.
source: Only the enabled state of a built-in rule can be changed.
ru: У встроенного правила меняется только включение.

# Убрать из разрешённых директорий
source: Remove from allowed directories
ru: Убрать из разрешённых директорий

# Удалить
source: Delete
ru: Удалить

# Удалить беседу?
source: Delete conversation?
ru: Удалить беседу?

# Удалить выбранное действие
source: Delete selected action
ru: Удалить выбранное действие

# Удалить действие?
source: Delete action?
ru: Удалить действие?

# Удалить правило
source: Delete rule
ru: Удалить правило

# Удалить…
source: Delete…
ru: Удалить…

# Укажите модель.
source: Specify a model.
ru: Укажите модель.

# Укажите полный HTTP(S)-адрес LLM-сервера.
source: Enter a complete HTTP(S) address for the LLM server.
ru: Укажите полный HTTP(S)-адрес LLM-сервера.

# Уровень
source: Level
ru: Уровень

# Устаревшие записи удаляются при следующем запуске приложения.
source: Expired entries are deleted the next time the app starts.
ru: Устаревшие записи удаляются при следующем запуске приложения.

# Что ты умеешь делать с файлами?
source: What can you do with files?
ru: Что ты умеешь делать с файлами?

# Шаблон промпта
source: Prompt template
ru: Шаблон промпта

# Широкая область разрешения
source: Broad permission scope
ru: Широкая область разрешения

# Экспорт журнала по текущим фильтрам
source: Export log with current filters
ru: Экспорт журнала по текущим фильтрам

# Экспорт по текущим фильтрам…
source: Export with current filters…
ru: Экспорт по текущим фильтрам…

source: This list changes only the risk level. SecurityRule blocks remain effective independently.
ru: Этот список меняет только уровень риска. Запреты SecurityRule продолжают действовать независимо от него.

# Язык
source: Language
ru: Язык

# Язык интерфейса
source: Interface language
ru: Язык интерфейса

# аргумент — произвольный код, политика неприменима
source: the argument is arbitrary code; the policy cannot apply
ru: аргумент — произвольный код, политика неприменима

# вернутся к исходным, а удалённые действия будут созданы заново.
source: will return to their defaults, and deleted actions will be recreated.
ru: вернутся к исходным, а удалённые действия будут созданы заново.

# все они будут включены. Отсутствующие правила появятся снова.
source: all will be enabled. Missing rules will be recreated.
ru: все они будут включены. Отсутствующие правила появятся снова.

# его вручную через ⌘V.
source: it manually with ⌘V.
ru: его вручную через ⌘V.

# загружена
source: loaded
ru: загружена

# к Универсальному доступу.
source: Accessibility access.
ru: к Универсальному доступу.

source: addresses used by npm install, git pull or arbitrary scripts cannot be determined statically.
ru: невозможно статически определить адреса npm install, git pull или произвольного скрипта.

# путь проверяется как read_file. Это не разрешение на выполнение.
source: the path is checked as read_file. This does not authorize execution.
ru: путь проверяется как read_file. Это не разрешение на выполнение.

source: Approve
ru: Одобрить

source: Reject
ru: Отклонить

# Диалог: %@
source: Conversation: %@
ru: Диалог: %@

# Длительность выполнения: %@
source: Execution duration: %@
ru: Длительность выполнения: %@

# Загружено: %lld
source: Loaded: %lld
ru: Загружено: %lld

# Канонический паттерн: %@
source: Canonical pattern: %@
ru: Канонический паттерн: %@

# Не найден (%@:%lld)
source: Not found (%@:%lld)
ru: Не найден (%@:%lld)
